#include "stdio.h"
#include <string>
#include <vector>
#include <iostream>
#include <fstream>
#include <sstream>
#include <algorithm> 
#include <functional> 
#include <cctype>
#include <locale>

#pragma pack(1)

using namespace std;

int ProgBase = 0x1000;					//High memory base
int DataBase = 0x40;					//Dynamic and static memory
int firstAssemble = 0;					//first pass or second pass assembly
////////////////////////////////////////////////////////////
// Declare structures
/////////////////////////////////////////////////////////////
typedef int(*ProcessFuncPtr)(string args, string type, int opcode, string flags, int linenum, bool bBranchType, bool xcall);

typedef struct INSTRUCTION_INFO {
	string instname;				//Instruction name
	string insttype;				//Instruction type
	int opcode;						//opcode
	string resulttype;				//result type
	ProcessFuncPtr func;			//process function
} STINSTRUCTION, *LPSTINSTRUCTION;

typedef struct ZHEADER {
	char ver;				//0
	short Flags;			//1
	char releasenumber;				//3
	short highMemBase;		//4
	short entry;			//6
	short loc_dictionary;	//8
	short loc_objtable;		//A	
	short loc_global;		//C
	short staticMemBase;	//E
	char v10;				//10 Flag1
	char v11;
	char serial[6];
	short loc_abb;			//18
	short filelen;			//1A
	short checksum;			//1C
	char internum;			//1E
	char interver;			//1F
	char scrheight;			//20
	char scrwidth;			//21
	short scrhinunit;		//22
	short scrwinunits;		//24
	char fontwinunit;		//26
	char fonthinunit;		//27
	short routineoffset;	//28
	short staticstringoffset;	//2A
	char defbackcolor;			//2C
	char defforecolor;			//2D
	short addr_termchar_table;	//2E
	short totalwidth;			//30
	short std_rev_num;			//32
	short alptable;				//34
	short hexextaddr;			//36
	short v38;					//38
	short v3A;					//3A
	short v3C;
	short v3E;
} stZHEADER, *LPZHEADER;

typedef struct ZOBJECT{
	string objname;
	short flag1;		//Object flags for 48bit
	short flag2;
	short flag3;
	short LOC;			//Parent Position
	short FIRST;		//First sibling
	short NEXT;			//Siblings	
	short proptable;	//prop table address
	int offset;
	int objnum;			//object number 1~63
} stZObject;

struct TABLEITEM{		//Table's item
	string type;
	vector<short> data;
	int offset;
};
struct TABLE {
	string name;				//Tables
	int maxsize;
	vector<TABLEITEM> items;
	int offset;
};
struct GLOBALS {				//Global label's
	string datatype;
	string name;
	vector<unsigned short> value;
	int type;
	int offset;
};
struct GLOBALVARIABLE{				//Global variables
	string name;
	vector<unsigned short> value;
	char num;
	int offset;
};
struct LOCALVARIABLE {			//Local variables
	string name;
	char localnum;
};
struct LOCALLABEL {				//
	string name;
	string functionname;
	int offset;
};
#define OPCODE_COUNT	113
#define DELIMITER	" "
#define COMMENTCHAR	';'
#define ALIGNMENT	4
#define TYPE_CODE	1
#define TYPE_DATA	0
#define MAXCHARS	65536

vector<char> assembled;					//assembled code
vector<char> databytes;					//assembled data bytes
vector<string> gInstructions;			//string by lines;
vector<STINSTRUCTION> gOpcodes;			//opcode table
vector<GLOBALS> gGlobalLabels;			//global label
vector<TABLE> gTables;					//tables
vector<ZOBJECT> gObjects;				//objects
vector<GLOBALVARIABLE> gVariables;		//global variables
vector<LOCALVARIABLE> gLocalVariables;	//local variables
vector<LOCALLABEL> gLocalLabels;		//local labels
int zversion = 6;					//default version
string serialnum = "";				//serial number
unsigned short releasenum = 1;		//program's release number
int global_num = 16;				//Global variable number
int object_num = 1;					//Global object number;
string gfuncname;					//Current function name

STINSTRUCTION codeTable_YZIP[255] = {
	{ "catch", "0op", 185, "result" },
	{ "crlf", "0op", 187, "" },
	{ "noop", "0op", 180, "" },
	{ "original", "0op", 191, "branch" },
	{ "rstack", "0op", 184, "" },
	{ "rfalse", "0op", 177, "" },
	{ "rtrue", "0op", 176, "" },
	{ "printr", "0op", 179, "" },
	{ "quit", "0op", 186, "" },
	{ "restart", "0op", 183, "" },
	{ "usl", "0op", 188, "" },
	{ "verify", "0op", 189, "branch" },
	{ "add", "2op", 20, "result" },
	{ "band", "2op", 9, "result" },
	{ "ashift", "ext", 259, "result" },
	{ "bufout", "ext", 242, "" },
	{ "icall1", "1op", 143, "" },
	{ "call1", "1op", 136, "result" },
	{ "icall2", "2op", 26, "" },
	{ "call2", "2op", 25, "result" },
	{ "xcall", "ext", 236, "result" },
	{ "icall", "ext", 249, "" },
	{ "ixcall", "ext", 250, "" },
	{ "call", "ext", 224, "result" },
	{ "assigned?", "ext", 255, "branch" },
	{ "fclear", "2op", 12, "" },
	{ "copyt", "ext", 253, "" },
	{ "dec", "1op", 134, "" },
	{ "dless?", "2op", 4, "branch" },
	{ "div", "2op", 23, "result" },
	{ "display", "ext", 261, "" },
	{ "zwstr", "ext", 252, "" },
	{ "clear", "ext", 237, "" },
	{ "erase", "ext", 238, "" },
	{ "dclear", "ext", 263, "" },
	{ "first?", "1op", 130, "result.branch" },
	{ "curget", "ext", 240, "" },
	{ "nextp", "2op", 19, "result" },
	{ "loc", "1op", 131, "result" },
	{ "getp", "2op", 17, "result" },
	{ "getpt", "2op", 18, "result" },
	{ "ptsize", "1op", 132, "result" },
	{ "next?", "1op", 129, "result.branch" },
	{ "winget", "ext", 275, "result" },
	{ "inc", "1op", 133, "" },
	{ "igrtr?", "2op", 5, "branch" },
	{ "dirin", "ext", 244, "" },
	{ "move", "2op", 14, "" },
	{ "equal?", "ext", 193, "branch" },
	{ "grtr?", "2op", 3, "branch" },
	{ "in?", "2op", 6, "branch" },
	{ "less?", "2op", 2, "branch" },
	{ "zero?", "1op", 128, "branch" },
	{ "value", "1op", 142, "result" },
	{ "bcom", "1op", 248, "result" },
	{ "getb", "2op", 16, "result" },
	{ "get", "2op", 15, "result" },
	{ "shift", "ext", 258, "result" },
	{ "menu", "ext", 283, "branch" },
	{ "mod", "2op", 24, "result" },
	{ "mouse-limit", "ext", 279, "" },
	{ "winpos", "ext", 272, "" },
	{ "mul", "2op", 22, "result" },
	{ "not", "ext", 248, "result" },
	{ "bor", "2op", 8, "result" },
	{ "dirout", "ext", 243, "" },
	{ "picinf", "ext", 262, "branch" },
	{ "check_unicode", "ext", 268, "" },
	{ "picture_table", "ext", 284, "" },
	{ "fstack", "ext", 277, "" },
	{ "printb", "1op", 135, "" },
	{ "printc", "ext", 229, "" },
	{ "printf", "ext", 282, "" },
	{ "printn", "ext", 230, "" },
	{ "print", "1op", 141, "" },
	{ "printt", "ext", 254, "" },
	{ "print_unicode", "ext", 267, "" },
	{ "pop", "ext", 233, "" },
	{ "push", "ext", 232, "" },
	{ "xpush", "ext", 280, "branch" },
	{ "putp", "ext", 227, "" },
	{ "winput", "ext", 281, "" },
	{ "random", "ext", 231, "result" },
	{ "read", "ext", 228, "result" },
	{ "input", "ext", 246, "result" },
	{ "mouse-info", "ext", 278, "" },
	{ "remove", "1op", 137, "" },
	{ "restore", "ext", 257, "result" },
	{ "irestore", "ext", 266, "result" },
	{ "return", "1op", 139, "" },
	{ "save", "ext", 256, "result" },
	{ "isave", "ext", 265, "result" },
	{ "intbl?", "ext", 247, "result.branch" },
	{ "scroll", "ext", 276, "" },
	{ "fset", "2op", 11, "" },
	{ "color", "2op", 27, "" },
	{ "curset", "ext", 239, "" },
	{ "font", "ext", 260, "result" },
	{ "margin", "ext", 264, "" },
	{ "hlight", "ext", 241, "" },
	{ "window", "ext", 235, "" },
	{ "sound", "ext", 245, "" },
	{ "split", "ext", 234, "" },
	{ "set", "2op", 13, "" },
	{ "putb", "ext", 226, "" },
	{ "put", "ext", 225, "" },
	{ "sub", "2op", 21, "result" },
	{ "btst", "2op", 7, "branch" },
	{ "fset?", "2op", 10, "branch" },
	{ "throw", "2op", 28, "" },
	{ "lex", "ext", 251, "" },
	{ "winsize", "ext", 273, "" },
	{ "winattr", "ext", 274, "" }
};

///////////////////////
//Special purpose function declaration
////////////////////////
void jump_function(string name);		//jump opcodes functions
void print_function(string arg);		//printi, printf functions
char GetOperandType(string arg);		//Get Operand type.
char get2opArgment(string arg);			//Get opcode 2 argument
char Get2_ExtArgType(string arg);		//opcode2_ext function's argument type
bool CheckandUpdateOffset(GLOBALS *g);	//update offset(if is exist only update offset)
bool CheckandUpdateGVariable(string name, int offset);
bool CheckandUpdateObj(string name, int offset);
bool CheckandUpdateTable(string name, int offset);
unsigned short GetOperandValues(string arg, unsigned char *valsize);	//Get Operand value
/////////////////////////////////////
// String functions
/////////////////////////////////////
string & ltrim(string & str);
string & rtrim(string & str);
string trim(string &s);
string & makebackslash(string &s);
void ZcharEncode(char chin, vector<char>*zcharstr);
int ZStringEncode(const char *pin, char*pout);
bool is_number(string s);
string strlower(string arg);
string strupper(string arg);
string str_replace(string arg1, char arg2, char arg3);
string str_replace(string arg1, string arg2, string arg3);
int Split(string arg, string delimiter, string *res);
///////////////////////////////////////////////////////////////
// Main function declr
//////////////////////////////////////////////////////////////
void WriteToFile(string outfile);					//Write assembly to file
void ReadLinebyLine(ifstream *fp);					//Read file by line
void Assembly();									//Assembly file
void initOpFunctions();								//Init opcodes
void jump_to(string name, vector<char> *opcodes, bool mode);	//jump functions process
int lineProcess(string token, string line, int linenum);
int GetVariableNumber(string arg);
unsigned short getOffset(string arg, unsigned char*p);
string getFileName(string org);
void makeSerial(char*p);
//////////////////////////////////////////////////////////////
// Special function implementation
////////////////////////////////////////////////////////////
/*
parameter : name
This is jump label, for example jump /jumppos
jump /jumppos
...
...
jumppos:
PRINTI "This is jump position"
This function generate opcode for jump.
*/
void jump_function(string name) {
	assembled.push_back(140);				//jump opcode is 140
	int pos = ProgBase + assembled.size();  //current cmd position
	unsigned short temp;					//temperate varialbe
	unsigned char ch;
	temp = getOffset(name, &ch);				//get jump offset
	if (temp) {
		temp = (temp - pos) & 0xFFFF;		//convert new position to byte array and add it.
		assembled.push_back(temp >> 8);		//top byte
		assembled.push_back(temp & 0xFF);	//low byte
	}
	if (temp == 0) {
		if (firstAssemble == 1) {			//if first pass assemble, offset is 0
			assembled.push_back(0);
			assembled.push_back(0);
		}
		else {
			cout << "Invalid jmp label:" << name << endl;	//if second pass, and not exist, it will be error;
			exit(1);
		}
	}
	return;
}
/*
parameter : string arg
This is string to display;

PRINTI "This is a string."

Strins have to start " and end ".

*/
void print_function(string arg) {
	if (arg.at(0) != '"') {
		cout << "Invalid print string" << arg << endl;	//Check string
		return;
	}
	if (arg.back() != '"') {
		cout << "Invalid print string" << arg << endl;	//Check string.
		return;
	}
	arg.erase(0, 1);					//Erase first and last character "
	arg.erase(arg.length() - 1, 1);
	arg = str_replace(arg, """", "\""); // "" is replaced \"
	
	char chbuff[MAXCHARS] = { 0 };
	int i, nsize;
	nsize = ZStringEncode(arg.c_str(), chbuff);	//encode string to zscii
	assembled.push_back(178);					//printi opcode;
	for (i = 0; i < nsize; i++) {
		assembled.push_back(chbuff[i]);			//push opcodes
	}
	return;
}
/*
parameter : string name
int offset
return value : bool
whether name exist or not.

when first assemble, all offset is zero
and second assemble, we have to update only offset.
*/
bool CheckandUpdateOffset(GLOBALS *g) {
	size_t i, j;
	bool bex = 0;
	for (i = 0; i < gGlobalLabels.size(); i++) {	//Get Labels size and loop
		GLOBALS st = gGlobalLabels.at(i);
		if (strlower(st.name) == strlower(g->name)) {		//Check label name
			//if (st.offset == 0)							//if offset is 0
			gGlobalLabels.at(i).offset = g->offset;	//update offset
			gGlobalLabels.at(i).datatype = g->datatype;	//update offset
			gGlobalLabels.at(i).value.clear();
			for (j = 0; j < g->value.size(); j++)
				gGlobalLabels.at(i).value.push_back(g->value.at(j));

			bex = 1;									//update flag
			break;
		}
	}
	return bex;
}
/*
parameter : string name			: local label name
string funcname		: function's name
int offset			: label offset
return value : bool
whether name exist or not.

when first assemble, all offset is zero
and second assemble, we have to update only offset.
*/
bool CheckandUpdateLocal(string name, string funcname, int offset) {
	size_t i;
	bool bex = 0;
	for (i = 0; i < gLocalLabels.size(); i++) {		//check label loop
		LOCALLABEL st = gLocalLabels.at(i);
		if (strlower(st.name) == strlower(name) && strlower(st.functionname) == strlower(funcname)) {
			if (st.offset == 0)
				gLocalLabels.at(i).offset = offset;	//update offset
			bex = 1;
			break;
		}
	}
	return bex;
}
/*
parameter :			string name			: table name
int offset			: label offset
return value : bool
whether name exist or not.

when first assemble, all offset is zero
and second assemble, we have to update only offset.
*/
bool CheckandUpdateTable(string name, int offset) {
	size_t i;
	bool bex = 0;
	for (i = 0; i < gTables.size(); i++) {
		TABLE st = gTables.at(i);
		if (strlower(st.name) == strlower(name)) {		//table name compare
			if (st.offset == 0)
				gTables.at(i).offset = offset;			//update offset
			bex = 1;
			break;
		}
	}
	return bex;
}
/*
parameter :				string name			: object name
int offset			: label offset
return value : bool
whether name exist or not.

when first assemble, all offset is zero
and second assemble, we have to update only offset.
*/
bool CheckandUpdateObj(string name, int offset) {
	size_t i;
	bool bex = 0;
	for (i = 0; i < gObjects.size(); i++) {
		ZOBJECT st = gObjects.at(i);
		if (strlower(st.objname) == strlower(name)) {	//check name
			if (st.offset == 0)
				gObjects.at(i).offset = offset;	//update offset
			bex = 1;
			break;
		}
	}
	return bex;
}
/*
parameter :			string name			: global variable name
int offset			: label offset
return value : bool
whether name exist or not.

when first assemble, all offset is zero
and second assemble, we have to update only offset.
*/
bool CheckandUpdateGVariable(string name, int offset) {
	size_t i;
	bool bex = 0;
	for (i = 0; i < gVariables.size(); i++) {
		GLOBALVARIABLE st = gVariables.at(i);
		if (strlower(st.name) == strlower(name)) {
			if (st.offset == 0)
				gVariables.at(i).offset = offset;
			bex = 1;
			break;
		}
	}
	return bex;
}
/*
parameter :			string arg			: string name of variable

return value : int
if assigned variable return 1~255
else return 0
First remove prefixs like ' and >
return get variable number
*/
int GetVariableNumber(string arg) {
	arg = str_replace(arg, "'", "");			//remove '
	arg = str_replace(arg, ">", "");			//remove >
	int i, pos = gLocalVariables.size();				//check local variable first
	for (i = 0; i < pos; i++)
	{
		LOCALVARIABLE lv = gLocalVariables.at(i);
		if (trim(lv.name) == trim(arg))			//compare name
			return lv.localnum;					//return variable number
	}
	pos = gVariables.size();					//global variables list.
	for (i = 0; i < pos; i++)
	{
		GLOBALVARIABLE gv = gVariables.at(i);	//check with global variable name
		if (trim(gv.name) == trim(arg))
			return gv.num;						//return variable number
	}
	return 0;								//can not found, then return 0
}
/*
parameter :			string arg			: string name of variable

return value : char 0~3
00 : long imm or offset
01 : imm
10 : variable
11 : undefined

Check arg is variable first. then return 2 : 10
and check ', If ' then that is imm value.
if arg is number and >=0 and < 256 then return 01;
if arg is object name then return imm
and return 0 : long imm
*/
char GetOperandType(string arg) {
	size_t i;
	arg = trim(arg);
	int gv = GetVariableNumber(arg);	//Is variable
	if (arg.find("'") != string::npos)	//if set 'x, 10 then x is not variable x is imm type
		return 1;					//01 is imm type
	if (gv != 0)					//This is variable
		return 2;					//10 is variable
	if (is_number(arg))				//is imm?
	{
		if (stoi(arg) < 256 && stoi(arg) >= 0)	//if value >=
			return 1; //01
	}
	for (i = 0; i < gObjects.size(); i++) {			//check arg is object name
		ZOBJECT st = gObjects.at(i);
		if (strlower(st.objname) == strlower(arg))
			return 1;					//return 01
	}
	return 0;// This operand is long imm or offset varialbe
}
/*
parameter :			string arg			: string name of variable

return value :	char 0~3
00 : long imm
01 : imm
10 : variable
11 : no more operand

This function check arg2 and ext argument count and type.
if arg is emptry string then no more operand(3) returns.

*/
char Get2_ExtArgType(string arg) {
	if (arg == "")						//if string is empty
		return 3;						//no more operand

	char ch = GetOperandType(arg);		//get operand type
	if (ch == 1)						//1 means immediate
		return 1;						//return 01 : immediate
	if (ch == 2)						//2 means variable
		return 2;						//return 2;
	if (is_number(arg)) {				//if arg is number and bigger than 256
		if (stoi(arg) >= 256)			//then that is long imm
			return 0;
	}
